{
    "real_text": "Gautam Gambhirclinched his first title as the head coach of the Indian team as the boys defeated New Zealand in the ICC Champions Trophy final. Gambhir, who replaced the big void left byRahul Dravidafter India's T20 World Cup 2024 triumph, was subjected to plenty of criticism over certain results, especially in red-ball cricket, but he delivered a knockout punch to critics as India won the Champions Trophy title for the second time in the nation's history. Amid celebrations in the Dubai International Cricket Stadium, a priceless moment unfolded between Gambhir and former India cricketer Navjot Singh Sidhu.\nSidhu, who is known for his proses and poetry, especially while sitting in the commentary box, witnessed Gambhir don the hat of a poet in front of him. The result was absolutely spellbinding.\n\"Fann kuchalne ka hunar seekhiye janab...\", said Gambhir before Sidhu completed it saying, \"saapon ke darr se jungle nahi chhore jaate.\"\n\"The Shayari that he asked me to narrate has a lot to say … he @GautamGambhir is here to stay … wish him and the Indian cricket team the very best …. You made India proud brother,\" Sidhu captioned the post.\nThe Shayari that he asked me to narrate has a lot to say … he@GautamGambhiris here to stay … wish him and the Indian cricket team the very best …. You made India 🇮🇳 proud brotherpic.twitter.com/TRnJKWh6Ii\nSidhu then also dared Gambhir to do Bhangra but the India head coach chickened out. Though Gambhir did give a Bhangra pose later on, he didn't dance even as Sidhu insisted repeatedly.\nAfter the game, India captainRohit Sharmaalso lauded Gambhir after the match, thanking him for back the way he wanted to play, as well as the mindset he wanted to instill in the team.\n\"It (attacking game) is not natural to me but it is something I really wanted to do, when you are trying to do something different you need the backing of the team, you need the backing of the management and they were right through with me. In the ODI World Cup as well with Rahul bhai, this is what I spoke to him and he was very much okay with it, and now Gauti bhai as well. It's all about getting the backing of the team and the management as well. It's something I really wanted to do. I have played all these years in a different style, but I wanted to try and do something different, try and see if we can play differently and get the results that we were looking for,\" Rohit had said after the game.\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement",
    "similarity_score": -0.6508
}