[
    {
        "title": "Trump Declares A Trade War On Uninhabited Islands, US Military, And Economic Logic",
        "description": "There’s a fundamental problem with Donald Trump’s new trade policy: it fails a test that actual 5th graders can pass. I know this because I tried explaining his “Liberation Day” trade plan to one last night. Here’s how that conversation went: “Imagine you wan…",
        "content": "from the when-you-don't-understand-trade,-everything-looks-like-theft dept\r\nThere’s a fundamental problem with Donald Trump’s new trade policy: it fails a test that actual 5th graders can pass. I kno… [+12721 chars]",
        "url": "https://www.techdirt.com/2025/04/03/trump-declares-a-trade-war-on-uninhabited-islands-us-military-and-economic-logic/"
    },
    {
        "title": "Trump Has Already Botched His Own Bad Tariff Plan",
        "description": "Once you’ve said you might negotiate, nobody is going to believe you when you change your mind and say you’ll never negotiate.",
        "content": "Donald Trump had a plan. It was not a good plan, or even a plausible one. But it was, at least, a coherent plan: By imposing large trade barriers on the entire world, he would create an incentive for… [+5010 chars]",
        "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-negotiation-tariff/682300/?utm_source=yahoo"
    },
    {
        "title": "Yes, Trump placed tariffs on uninhabited group of islands occupied mainly by penguins",
        "description": "U.S. President Donald Trump placed reciprocal tariffs on a group of uninhabited islands occupied only by penguins and other wildlife.",
        "content": "Claim:\r\nU.S. President Donald Trump placed reciprocal tariffs on a group of uninhabited islands occupied only by penguins and other wildlife.\r\nFollowing U.S. President Donald Trump's \"Liberation Day\"… [+4906 chars]",
        "url": "https://www.snopes.com//fact-check/trump-tariffs-heard-and-mcdonald-islands-penguins/"
    },
    {
        "title": "Trump has paused tariffs plan for most countries. Here's context",
        "description": "The president announced a 90-day pause on new rates for more than 75 trading partners, excluding China.",
        "content": "'EU Pushes Back Hard against Trump Tariff Threats and His Caustic Comments That Bloc Is out to Get US'. AP News, 27 Feb. 2025, https://apnews.com/article/eu-us-trump-trade-war-tariffs-e799b44cbaf81b1… [+7669 chars]",
        "url": "https://www.snopes.com//news/2025/04/09/trump-pauses-tariffs/"
    },
    {
        "title": "'Nowhere on Earth is safe': Trump imposes tariffs on uninhabited islands near Antarctica (The Guardian)",
        "description": "The Guardian:\n‘Nowhere on Earth is safe’: Trump imposes tariffs on uninhabited islands near Antarctica  —  Australian prime minister surprised after external territories - including tiny Norfolk Island and remote islands home to penguins - targeted by US pres…",
        "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]",
        "url": "https://www.memeorandum.com/250403/p33"
    }
]