[
    {
        "title": "Trump Has Already Botched His Own Bad Tariff Plan",
        "description": "Once you’ve said you might negotiate, nobody is going to believe you when you change your mind and say you’ll never negotiate.",
        "content": "Donald Trump had a plan. It was not a good plan, or even a plausible one. But it was, at least, a coherent plan: By imposing large trade barriers on the entire world, he would create an incentive for… [+5010 chars]",
        "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-negotiation-tariff/682300/?utm_source=yahoo",
        "full_text": "Once you’ve said you might negotiate, nobody is going to believe you when you change your mind and say you’ll never negotiate.\nProduced by ElevenLabs andNews Over Audio (Noa)using AI narration. Listen to more stories on the Noa app.\nDonald Trump had a plan. It was not a good plan, or even a plausible one. But it was, at least, acoherentplan: By imposing large trade barriers on the entire world, he would create an incentive for American business to manufacture and grow all the goods the country previously imported.\nWhatever chance this plan had to succeed is already over.\nThe key to making it work was to convince businesses that the new arrangement is durable. Nobody is going to invest in building new factories in the United States to create goods that until last week could be imported more cheaply unless they’re certain that the tariffs making the domestic version more competitive will stay in place. (They’re probably not going to do it anyway, in part because they don’t know who will be president in four years, but the point is that confidence in durable tariffs is a necessary condition.)\nTrump’s aidesgraspedthis dynamic. “This is the great onshoring, the great reshoring of American jobs and wealth,” Stephen Miller, Trump’s deputy chief of staff,declaredon “Liberation Day.” The White House accordinglycirculatedtalking points instructing its surrogates not to call the tariffs a leverage play to make deals, but to instead describe them as a permanent new feature of the global economy.\nBut not everybody got the idea. Eric Trumptweeted, “I wouldn’t want to be the last country that tries to negotiate a trade deal with @realDonaldTrump. The first to negotiate will win - the last will absolutely lose.”\nEric’s father apparently didn’t get the memo either. Asked by reporters whether he planned to negotiate the tariff rates, the president said, “The tariffs give us great power to negotiate. They always have.”\nSomeone seems to have then told Trump that this stance would paralyze business investment, because he reversed course immediately,writingon Truth Social, “TO THE MANY INVESTORS COMING INTO THE UNITED STATES AND INVESTING MASSIVE AMOUNTS OF MONEY, MY POLICIES WILL NEVER CHANGE.”\nHowever, there is a principle at work here called “No backsies.” Once you’ve said you might negotiate the tariffs, nobody is going to believe you when you change your mind and say you’ll never negotiate.\nDerek Thompson: There is only one way to make sense of the tariffs\nIndeed, precisely two hours and 17 minutes after insisting that his policies would never change, Trumpreturnedto Truth Social to announce excitedly that the policies were going to change: “Just had a very productive call with To Lam, General Secretary of the Communist Party of Vietnam, who told me that Vietnam wants to cut their Tariffs down to ZERO if they are able to make an agreement with the U.S. I thanked him on behalf of our Country, and said I look forward to a meeting in the near future.”\nThe possibility remains that Trump will revert to insisting that the tariffs are permanent and irrevocable. The day is still young.\nTo be sure, signaling openness to negotiation on tariffs is also a plan. But it’s a very different plan than attracting massive investment into domestic production. The idea behind this other plan is a game of chicken: We think the balance of trade protection is unfavorable to the United States, and could be made more favorable by leveling the playing field. Threatening a global trade war imposes pain on other countries, making them willing to reduce their tariffs on American goods, leading to freer global trade.\nThis strategy relies not on convincing businesses that Trump is completely serious, but instead on making other world leaders believe that Trump is willing to endure fantastic amounts of economic pain in order to gain bargaining leverage. “Sometimes the best strategy in a negotiation is convincing the other side that you are crazy,” the investor and pro-Trump social-media influencer Bill Ackmanrationalizedon X.\nCould it work? Like the original plan, this is not a good one by any means. Attempting to negotiate new trade deals with almost every country and territory in the world, some of which areuninhabited, poses a formidable diplomatic challenge. (Do penguins have a trade representative?) There is very little in Trump’s record to suggest that he’s going to pull it off. The fact that he is freezing domestic investment decisions in the meantime and risking stagflation or a recession is going to undermine his leverage rather than increase it.\nWe’re the ones who are waging a trade war against the entire planet. Attempting to intimidate all other countries at the same time is a bit like a school bully walking into the cafeteria and announcing that everybody has to start handing over their lunch money on an ongoing basis. The strong-arm method is best suited for one-on-one negotiations, rather than giving everyone an incentive to band together in self-protection.\nIn any case, the madman approach to achieving freer global trade by tanking the American economy, whatever odds it may stand of success, is simply not the same thing as creating a permanent new system of protected domestic industry. That vision had danced in Trump’s head since the 1980s. He decided that now was his chance to finally make it happen. It lasted less than a day."
    },
    {
        "title": "Yes, Trump placed tariffs on uninhabited group of islands occupied mainly by penguins",
        "description": "U.S. President Donald Trump placed reciprocal tariffs on a group of uninhabited islands occupied only by penguins and other wildlife.",
        "content": "Claim:\r\nU.S. President Donald Trump placed reciprocal tariffs on a group of uninhabited islands occupied only by penguins and other wildlife.\r\nFollowing U.S. President Donald Trump's \"Liberation Day\"… [+4906 chars]",
        "url": "https://www.snopes.com//fact-check/trump-tariffs-heard-and-mcdonald-islands-penguins/",
        "full_text": "About this rating\nPenguins are the most abundant birds on the Heard Island and McDonald Islands group. The islands are also home to other animals including seals, flying birds and invertebrates — but no humans.\nFollowing U.S. President Donald Trump's \"Liberation Day\" tariffsannouncementon April 2, 2025, aclaim(archived) circulated that the countries hit by Trump's reciprocal tariffs included an island inhabited only by penguins.\nOne X user wrote: \"The Trump administration has put a 10 percent tariff on the Heard Island and McDonald which has a population of 0 people and is inhabited only by penguins.\"\nThe claim spread acrossFacebook(archived),X(archived),Threads(archived),Bluesky(archived) andReddit(archived).\nThe claim pertained to the Heard Island and McDonald Islands (HIMI), an uninhabited island group that is part of the external territory of Australia and located near Antarctica. The islands are home to penguins, seals and, according to theCIA World Factbookand the Australiangovernment, no humans.\nThe Trump administration'stariffs list(archived), posted on the White House X account, did indeed include the \"Heard and McDonald Islands,\" which were hit with 10% \"discounted reciprocal\" tariffs. Therefore, we rate this claim true.\nWe reached out to the White House to ask why an island group with no human inhabitants was included on its tariffs list. We also asked why HIMI was listed separately from Australia, given the island group's classification as Australian territory and the fact that \"mainland\" Australia and HIMI were hit with the same 10% tariffs. We await the White House's reply.\nWe also reached out to the Australian Department of the Prime Minister and Cabinet for its latest comment on the HIMI tariffs and await a reply.\nAccording toUNESCO, which includes the island group on its World Heritage List of locations with \"outstanding universal value\":\nThe distinctive conservation value of Heard and McDonald – one of the world's rare pristine island ecosystems – lies in the complete absence of alien plants and animals, as well as human impact.\nThe Australian government also highlighted the care taken to minimize human impact on the island group. According to the governmentwebsite:\nSince the first landing on Heard Island in 1855, there have been only approximately 240 shore-based visits to the island, and only two landings on McDonald Island (in 1971 and 1980).\nIn lieu of humans, the island'sinhabitantsinclude flying birds, penguins, seals and invertebrates. Penguins are the most abundant birds on the islands.\nDespite this, import and exportfiguresfrom the World Bankreportedby the Guardian appeared to show that the U.S. imported $1.4 million worth of goods from HIMI in 2022. Almost all of the imported goods were classed as \"mach and electric.\" It was not clear from the World Bank figures what specific products were imported by the U.S.\nTrump's \"Liberation Day\" tariffs list included more than180 countries and territories. The tariffs were due to take effect immediately after they were announced on April 2, 2025.\nSnopes keeps a runningtrackerof the Trump administration tariffs. Our previous reporting on claims related to the Trump administration's tariffs can be found under theTariffstag on our website.\nAnimals – Australian Antarctic Program. 4 July 2024, https://www.antarctica.gov.au/antarctic-operations/stations/other-locations/heard-island/nature/animals/.\nBohannon, Molly, and Antonio Pequeño IV. \"Here's The Full List Of Trump's Reciprocal Tariffs Announced Wednesday.\" Forbes, 2 Apr. 2025, https://archive.ph/M0JER#selection-3463.0-3463.14.\nCentre, UNESCO World Heritage. \"Heard and McDonald Islands.\" UNESCO World Heritage Centre, https://whc.unesco.org/en/list/577/. Accessed 3 Apr. 2025.\nHeard Island and McDonald Islands – Australian Antarctic Program. 9 July 2024, https://www.antarctica.gov.au/antarctic-operations/stations/other-locations/heard-island/.\nHuman Activities – Heard and McDonald Islands – Australian Antarctic Program. 28 Feb. 2005, https://www.antarctica.gov.au/antarctic-operations/stations/other-locations/heard-island/human-activities/.\nLyons, Kate, and Nick Evershed. \"'Nowhere on Earth Is Safe': Trump Imposes Tariffs on Uninhabited Islands near Antarctica.\" The Guardian, 3 Apr. 2025. The Guardian, https://www.theguardian.com/us-news/2025/apr/03/donald-trump-tariffs-antarctica-uninhabited-heard-mcdonald-islands.\n\"Regulating Imports with a Reciprocal Tariff to Rectify Trade Practices That Contribute to Large and Persistent Annual United States Goods Trade Deficits.\" The White House, 2 Apr. 2025, https://www.whitehouse.gov/presidential-actions/2025/04/regulating-imports-with-a-reciprocal-tariff-to-rectify-trade-practices-that-contribute-to-large-and-persistent-annual-united-states-goods-trade-deficits/.\nUnited States Product Exports and Imports to Heard Island and McDonald Isla 2022 | WITS Data. https://wits.worldbank.org/CountryProfile/en/Country/USA/Year/2022/TradeFlow/EXPIMP/Partner/HMD/Product/all-groups. Accessed 3 Apr. 2025.\n@WhiteHouse. X, 2 Apr. 2025, https://x.com/WhiteHouse/status/1907536535450218896.\nLaerke Christensen is a journalist based in London, England, with expertise in OSINT reporting.\nCompany\nNavigate\nSections\nAccount\n© 1995 - 2025  by Snopes Media Group Inc.\nThis material may not be reproduced without permission.\nSnopes and the Snopes.com logo are registered service marks of Snopes.com"
    },
    {
        "title": "Trump has paused tariffs plan for most countries. Here's context",
        "description": "The president announced a 90-day pause on new rates for more than 75 trading partners, excluding China.",
        "content": "'EU Pushes Back Hard against Trump Tariff Threats and His Caustic Comments That Bloc Is out to Get US'. AP News, 27 Feb. 2025, https://apnews.com/article/eu-us-trump-trade-war-tariffs-e799b44cbaf81b1… [+7669 chars]",
        "url": "https://www.snopes.com//news/2025/04/09/trump-pauses-tariffs/",
        "full_text": "Snopes is tracking tariffs U.S. President Donald Trump's administration has imposed on countries and products since his inauguration in January 2025here.\nHours after sweeping tariffs developed by U.S. President Donald Trump took effect on April 9, 2025, he unexpectedly announced on Truth Social a 90-day pause on most of the new rates, while increasing China's levy to 125% (archived). He posted:\nBased on the lack of respect that China has shown to the World's Markets, I am hereby raising the Tariff charged to China by the United States of America to 125%, effective immediately.. [...] Conversely, and based on the fact that more than 75 Countries have called Representatives of the United States [...] to negotiate a solution to the subjects being discussed [...] and that these Countries have not, at my strong suggestion, retaliated in any way, shape, or form against the United States, I have authorized a 90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately.\n(Truth Social/@realDonaldTrump)\nIn reaction,stocks soared.The S&P 500 stock index jumped 9.5% after Trump's announcement, The Associated Pressreported. Those gains followed days of a market rout around the world that worsened with an ongoing escalation of a trade war between the U.S. and China.\nBelow, we explain how the tariffs — and Trump's subsequent pause on most of them — came to be.\nDuring his 2024 reelection campaign, Trump announced that his economic program would include heavy tariffs on China and the rest of the world. At the time, he threatened 60% tariffs on Chinese goods and tariffs of 10% to 20% on goods from the rest of the world.\nHowever, now that he is in office, his implementation of tariffs is following a different playbook.\nIndeed, since his inauguration on Jan. 20, 2025, Trump has used tariffs in various ways. Sometimes he uses them as a negotiating chip to obtain concessions from other countries, as was the case with the Jan. 26showdown with Colombiaon immigration. Other times, he uses them as a cudgel to retaliate against countries whose actions he deems unacceptable, for example when the government Canada's Ontario province threatened toraise the cost of the energyit exports to the U.S. He also uses them as an economic tool to restore the trade balance in favor of the U.S., as he didwith Japan.\nTrump's policy has been described as a form ofneomercantilism. Mercantilism, an approach to trade developed between the 16th and 18th centuries, measured a nation's economic power by its trade surplus. In other words, a country was deemed rich when its exports exceeded its imports. Building wealth on exports rather than spending it on imports was the key idea.\nCritics of mercantilism say it failed to understand theprinciple of comparative advantage, later theorized by British economistDavid Ricardo. Ricardo said in 1817 that countries should focus on the products or services they make best and for which they can obtain a higher profit. The countries should then trade these products among themselves. Ricardo believed free trade based on comparative advantage would provide the inhabitants of a nation with cheaper products of better quality. Instead, mercantilism required protectionist policies and, often, high tariffs, which increased the cost of living of those who lived in the country practicing it.\nAsSnopes reported in September 2024, research on the tariffs Trump imposed during his first presidential term showed they were inflationary, and experts also expected new tariffs to add to the cost of living in the U.S.\nBut one key feature of the way Trump has deployed tariffs has been unpredictability. The president has repeatedly threatened to impose tariffs on countries only to cancel them shortly thereafter. As much as the effects of tariffs themselves, this uncertainty hascaused jitters among U.S. and global stock markets, and led economists and theFederal Reserve to slash their forecast for U.S. economic growth in 2025.\nOn April 2, 2025, Trump announced tariffs on imports from dozens of countries that export to the U.S. more than they import from it (the speech begins 55 minutes into the video):\nTrump held up a list of countries with the reciprocal tariffs he planned to impose on them, ranging from 10% to 49%. He said the tariffs would represent half of the tariffs these nations impose on U.S. goods, a calculation that supposedly includes \"currency manipulation and trade barriers.\" These individual reciprocal tariffs were set to take effect on April 9. The same list was later shared in aseriesoffourpostson X (archived). Further, he announced thatall countries would have tariffs imposed at a minimum 10%, effective April 5.\nThe markets' reaction was swift. Stocks plummeted around the world while investors sought safety in bonds:\nStocks fell furtheron April 4, 2025, afterChina retaliated with 34% tariffs on U.S. imports.\nMeanwhile, investors expected the dollar to rise, as a currency normally does when people are expected to spend less of their money on foreign goods.\nBut the projected magnitude of the tariffs' impact on the U.S. economy was such that the reserve currency dropped instead. \"The dollar is being sold against the big, liquid defensive currencies of the Japanese yen and Swiss franc and, to a lesser degree, the euro,\" Chris Turner, the global head of head of markets and regional head of research for the U.K. andCentraland Eastern Europe at INGwrote in a note. \"Here, the blowback of U.S. tariffs onto the U.S. domestic economy leaves the dollar naked.\"\nAsked what may have driven the dollar's depreciation, Kimberly Clausing, an economist at UCLA who has written extensively about tariffs, said in an email that it \"reflects some loss of confidence in theU.S.market, as ordinarily both the tariffs and the fiscal expansion (that Congress is presently preparing) would appreciate the dollar.\" Referring to the country's future ability to borrow money, she added: \"This basically signals a higher risk premium on U.S. borrowing.\"\n\"The [April 2] announcement was worse than I expected,\" Clausing said in the email. \"Tariffs were both higher and less principled than anticipated.\"Shewarned against consequences on thePeterson Institute for International Economics website:\nThese tariffs lack any principled rationale, and they risk economic catastrophe. The largest tax increase in more than fifty years will burdenU.S.consumers, generating thousands of dollars in tax increases for the median household. Retaliation and the tariffs on intermediate goods (a majority ofU.S.imports) will harmU.S.investment, production, and growth. Trump may wager that tariffs will return us to a better economic time but, in reality, they will leave behind only broken partnerships and economic devastation.\nOn X, Olivier Blanchard, a professor emeritus of economics at MIT, called the sweeping reciprocal tariffs \"simply stupid\" (archived):\nRunning bilateral trade surplus/deficits with different countries is the way it should be. Trying to eliminate each one is simply stupid.I have a trade deficit with my grocer, a trade surplus with my employer. I am not sure it would be a great idea for me to work for my grocer.…\n— Olivier Blanchard (@ojblanchard1)April 3, 2025\nAs Snopes reported in September 2024, sweeping tariffs are inflationary. On March 28, 2025, aconsumer sentiment surveyfrom the University of Michigan reported that inflation expectations were as high as they were in 2022, when the U.S. reachedthe highest inflation in more than 40 years. But after the announcement, theYale Budget Lab estimatedthat the tariffs would represent an annual loss of $3,800 for the average household in the U.S. in additional expenses.\nThechoice of territories targetedas well asthe calculations Trump's team used to reach these numbersalso baffled many, as Snopes reported previously.\nHere, Snopes is tracking the current state of U.S. tariffs, including their impact on the country's relationships with other countries.\n'EU Pushes Back Hard against Trump Tariff Threats and His Caustic Comments That Bloc Is out to Get US'. AP News, 27 Feb. 2025, https://apnews.com/article/eu-us-trump-trade-war-tariffs-e799b44cbaf81b19c37a57d7fd55ee6d.\n'Fact Sheet: President Donald J. Trump Adjusts Tariffs on Canada and Mexico to Minimize Disruption to the Automotive Industry'. The White House, 6 Mar. 2025, https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-adjusts-tariffs-on-canada-and-mexico-to-minimize-disruption-to-the-automotive-industry/.\n'---'. The White House, 6 Mar. 2025, https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-adjusts-tariffs-on-canada-and-mexico-to-minimize-disruption-to-the-automotive-industry/.\n'Fact Sheet: President Donald J. Trump Announces \"Fair and Reciprocal Plan\" on Trade'. The White House, 13 Feb. 2025, https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-announces-fair-and-reciprocal-plan-on-trade/.\n'Fact Sheet: President Donald J. Trump Imposes Tariffs on Imports from Canada, Mexico and China'. The White House, 2 Feb. 2025, https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-imposes-tariffs-on-imports-from-canada-mexico-and-china/.\n'Further Amendment to Duties Addressing the Synthetic Opioid Supply Chain in the People's Republic of China'. The White House, 3 Mar. 2025, https://www.whitehouse.gov/presidential-actions/2025/03/further-amendment-to-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/.\nIs Your Product USMCA Compliant? Here's What You Need to Know. http://www.nmma.org/press/article/25011. Accessed 21 Mar. 2025.\nMarch 2025 Fed Meeting: Interest Rates Kept Steady, Slower Economic Growth Projected | J.P. Morgan. https://www.jpmorgan.com/insights/outlook/economic-outlook/fed-meeting-march-2025. Accessed 21 Mar. 2025.\nMikolajczak, Chuck. 'Dow, S&P End Flat, Nasdaq Snaps Four-Week Decline on Tariff Hopes'. Reuters, 21 Mar. 2025. www.reuters.com, https://www.reuters.com/markets/us/futures-slip-tariff-woes-fedex-falls-after-cutting-forecast-2025-03-21/.\nParti, Tarini. 'Trump Threatens to Hit Russia With Sanctions in Push for Peace Deal'. The Wall Street Journal, 7 Mar. 2025, https://www.wsj.com/world/russia/trump-threatens-to-hit-russia-with-sanctions-6534bef8.\nRascouët-Paz, Anna. 'Trump's Proposed Tariffs: What Are They, and How Would They Affect US Economy?' Snopes, 19 Sept. 2024, https://www.snopes.com//news/2024/09/19/trump-tariffs-explainer/.\nShalal, Andrea, and Nandita Bose. 'Trump Says He Will Introduce 25% Tariffs on Autos, Pharmaceuticals and Chips'. Reuters, 19 Feb. 2025. www.reuters.com, https://www.reuters.com/business/autos-transportation/trump-auto-tariff-rate-will-be-around-25-2025-02-18/.\n'Statement from the Press Secretary'. The White House, 26 Jan. 2025, https://www.whitehouse.gov/briefings-statements/2025/01/statement-from-the-press-secretary/.\n'Trump Halts Doubling of Tariffs on Canadian Metals after Ontario Suspends Electricity Price Hikes'. AP News, 11 Mar. 2025, https://apnews.com/article/trump-economy-tariffs-stock-musk-business-8a5f28d9bb16e0b8a924d99ead0907fa.\n'Trump Tells Ishiba at the White House That He Wants to Slash the US Trade Deficit with Japan'. AP News, 7 Feb. 2025, https://apnews.com/article/trump-ishiba-us-japan-cd84a0e7306ab4b8b7e03bc8b76aa06c.\nTrump Threatens Denmark With Tariffs Over Greenland. 2025, https://www.bloomberg.com/news/videos/2025-01-07/trump-threatens-denmark-with-tariffs-over-greenland-video.\n'United States-Mexico-Canada Agreement'. United States Trade Representative, https://ustr.gov/trade-agreements/free-trade-agreements/united-states-mexico-canada-agreement. Accessed 21 Mar. 2025.\n'EU to Trump on Tariffs: Go Ahead, Make Our Day.' POLITICO, 28 Feb. 2025, https://www.politico.eu/article/donald-trump-tariffs-eu-trade-anti-coercion-instrument/.\nIntelligence, fDi. EU 'Bazooka' Response Expected to next US Tariffs. 20 Mar. 2025, https://www.fdiintelligence.com/content/ca42cb05-394a-41b5-875b-2ccec641f827.\n'New Tool to Enable EU to Withstand Economic Coercion Enters into Force'. European Commission - European Commission, https://ec.europa.eu/commission/presscorner/detail/en/https:\\/\\/ec.europa.eu\\/commission\\/presscorner\\/detail\\/en\\/ip_23_6804. Accessed 21 Mar. 2025.\n'Trump Threatens Retaliatory 200% Tariff on European Wine after EU Proposes American Whiskey Tax'. AP News, 13 Mar. 2025, https://apnews.com/article/trump-tariffs-eu-whiskey-cb259623a25ca1bfdb4673262ceef85b.\n'Absolute vs. Comparative Advantage: What's the Difference?' Investopedia, https://www.investopedia.com/ask/answers/033115/what-difference-between-comparative-advantage-and-absolute-advantage.asp. Accessed 24 Mar. 2025.\nGlobalization. https://web.uncg.edu/dcl/courses/global/unit2/part4.asp. Accessed 24 Mar. 2025.\nBhatt, Anjali. 'PIIE Experts React to Trump's Tariffs Announced April 2'. PIIE, 3 Apr. 2025, https://www.piie.com/blogs/realtime-economics/2025/piie-experts-react-trumps-tariffs-announced-april-2.\nChristensen, Laerke. 'Yes, Trump Placed Tariffs on Uninhabited Group of Islands Occupied Mainly by Penguins'. Snopes, 3 Apr. 2025, https://www.snopes.com//fact-check/trump-tariffs-heard-and-mcdonald-islands-penguins/.\n'Dow Opens Sharply Lower, Bonds Rally After China Retaliates Against Trump Tariffs'. Wall Street Journal, 4 Apr. 2025, https://www.wsj.com/livecoverage/stock-market-tariffs-trade-war-04-04-2025.\n'Fact Sheet: President Donald J. Trump Declares National Emergency to Increase Our Competitive Edge, Protect Our Sovereignty, and Strengthen Our National and Economic Security'. The White House, 2 Apr. 2025, https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-declares-national-emergency-to-increase-our-competitive-edge-protect-our-sovereignty-and-strengthen-our-national-and-economic-security/.\nGan, Juliana Liu, Nectar. 'China Imposes 34% Reciprocal Tariffs on Imports of US Goods in Retaliation for Trump's Trade War | CNN Business'. CNN, 4 Apr. 2025, https://www.cnn.com/2025/04/04/business/china-us-tariffs-retaliation-hnk-intl/index.html.\nHsu, Joanne. March 2025 Update: Current versus Pre-Pandemic Long-Run Inflation Expectations. University of Michigan, 28 Mar. 2025, http://www.sca.isr.umich.edu/files/px5web202503.pdf.\nIzzo, Jack. 'Posts Online Correctly Cracked the Formula for Trump's Tariffs'. Snopes, 4 Apr. 2025, https://www.snopes.com//news/2025/04/03/trump-tariff-formula/.\nPesole, Chris Turner, Frantisek Taborsky, Francesco. 'FX Daily: Without Domestic Support, Dollar Is Left a Little Naked'. ING Think, https://think.ing.com/articles/fx-daily-without-domestic-support-dollar-left-a-little-naked/. Accessed 4 Apr. 2025.\nRascouët-Paz, Anna. 'US Inflation Hit Highest Level in History Under Biden?' Snopes, 11 Sept. 2024, https://www.snopes.com//fact-check/biden-worst-inflation-in-us-history/.\nWhere We Stand: The Fiscal, Economic, and Distributional Effects of All U.S. Tariffs Enacted in 2025 Through April 2 | The Budget Lab at Yale. https://budgetlab.yale.edu/research/where-we-stand-fiscal-economic-and-distributional-effects-all-us-tariffs-enacted-2025-through-april. Accessed 4 Apr. 2025.\nLiptak, Elisabeth Buchwald, Kevin. 'Trump Announces 90-Day Pause on \"Reciprocal\" Tariffs with Exception of China | CNN Business'. CNN, 9 Apr. 2025, https://www.cnn.com/2025/04/09/business/reciprocal-tariff-pause-trump/index.html.\nLoGiurato, Brett, et al. 'Stock Market Today: Dow, S&P 500, Nasdaq Soar as Trump Announces \"90 Day Pause\" on Tariffs for Most Countries, Ups Levies on China'. Yahoo Finance, 9 Apr. 2025, https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-soar-as-trump-announces-90-day-pause-on-tariffs-for-most-countries-ups-levies-on-china-133616912.html.\nAnna Rascouët-Paz is based in Brooklyn, fluent in numerous languages and specializes in science and economic topics.\nCompany\nNavigate\nSections\nAccount\n© 1995 - 2025  by Snopes Media Group Inc.\nThis material may not be reproduced without permission.\nSnopes and the Snopes.com logo are registered service marks of Snopes.com"
    },
    {
        "title": "'Nowhere on Earth is safe': Trump imposes tariffs on uninhabited islands near Antarctica (The Guardian)",
        "description": "The Guardian:\n‘Nowhere on Earth is safe’: Trump imposes tariffs on uninhabited islands near Antarctica  —  Australian prime minister surprised after external territories - including tiny Norfolk Island and remote islands home to penguins - targeted by US pres…",
        "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]",
        "url": "https://www.memeorandum.com/250403/p33",
        "full_text": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\nUnlike sister sitesTechmemeandMediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated news consumers.\nView thecurrent pageor another snapshot:"
    }
]